Конфигурация/Catalogs/ДополнительныеОтчетыИОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДополнительныеОтчетыИОбработки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительныхОтчетовИОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСуммаФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенИнтерактивно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеВариантов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантЗапуска</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВызоваДополнительныхОбработок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказыватьОповещение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегламентноеЗаданиеGUID</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПараметров</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скрыть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВсеТипы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Скриншоты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Enums/ВидыДополнительныхОтчетовИОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДополнительныхОтчетовИОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ДополнительныеОтчетыИОбработки/Forms/ПанельДополнительныхОтчетовИОбработок/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура РекурсивноСоздатьДеревоГруппДопОтчетовИОбработок(ДеревоГруппДопОтчетовИОбработок, ГруппыДопОтчетовИОбработок, Родитель = Неопределено)
	
	Если Родитель = Неопределено Тогда
		Родитель = Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка();
	КонецЕсли;
	
	ГруппыПодчРодителю = ГруппыДопОтчетовИОбработок.НайтиСтроки(Новый Структура("Родитель", Родитель));
	
	Для каждого ГруппаПодчРодителю Из ГруппыПодчРодителю Цикл
		НоваяСтрокаДерева = ДеревоГруппДопОтчетовИОбработок.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДерева, ГруппаПодчРодителю);
		
		РекурсивноСоздатьДеревоГруппДопОтчетовИОбработок(НоваяСтрокаДерева, ГруппыДопОтчетовИОбработок, ГруппаПодчРодителю.Ссылка);
	КонецЦикла;
	
КонецПроцедуры // РекурсивноСоздатьДеревоГруппДопОтчетовИОбработок

&НаСервереБезКонтекста
Функция ПолучитьДеревоГрупп()
	
	ДеревоГруппДопОтчетовИОбработок = Новый ДеревоЗначений;
	ДеревоГруппДопОтчетовИОбработок.Колонки.Добавить("Ссылка",       Новый ОписаниеТипов("СправочникСсылка.ДополнительныеОтчетыИОбработки"));
	ДеревоГруппДопОтчетовИОбработок.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	
	КорневойУзелДерева = ДеревоГруппДопОтчетовИОбработок.Строки.Добавить();
	КорневойУзелДерева.Наименование = "Доп. отчеты и обработки";
	КорневойУзелДерева.Ссылка       = Справочники.ДополнительныеОтчетыИОбработки.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка,
		|	ДополнительныеОтчетыИОбработки.Родитель КАК Родитель,
		|	ПРЕДСТАВЛЕНИЕ(ДополнительныеОтчетыИОбработки.Ссылка) КАК Наименование
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|ГДЕ
		|	ДополнительныеОтчетыИОбработки.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДополнительныеОтчетыИОбработки.Наименование";
		
	ГруппыДопОтчетовИОбработок = Запрос.Выполнить().Выгрузить();
	ГруппыДопОтчетовИОбработок.Индексы.Добавить("Ссылка");
	
	РекурсивноСоздатьДеревоГруппДопОтчетовИОбработок(КорневойУзелДерева, ГруппыДопОтчетовИОбработок);
	
	Возврат ДеревоГруппДопОтчетовИОбработок;
	
КонецФункции // ПолучитьДеревоГрупп


&НаСервере
Процедура ЗаполнитьДеревоГруппНаСервере()
	
	ДеревоГруппНаСервере = РеквизитФормыВЗначение("ДеревоГрупп");
	
	РаботаСКоллекциями.ДеревоЗначений_ЗаполнитьИзДерева(ДеревоГруппНаСервере, ПолучитьДеревоГрупп());
	
	ЗначениеВРеквизитФормы(ДеревоГруппНаСервере, "ДеревоГрупп");
	
КонецПроцедуры // ЗаполнитьДеревоГруппНаСервере

&НаСервере
Процедура ОтобразитьСкриншотыНаСервере(ОтчетИлиОбработка)
	
	Если ЭтаФорма.ТекущийДополнительныйОтчетИлиОбработка = ОтчетИлиОбработка Тогда
		Возврат;
	Иначе
		ЭтаФорма.ТекущийДополнительныйОтчетИлиОбработка = ОтчетИлиОбработка;
	КонецЕсли;
	
	// чтобы не захламлять память ацкими объемами картинок, удалим скриншоты из хранилища
	Для каждого ЭлементСкриншот Из Элементы.ГруппаСкриншоты.ПодчиненныеЭлементы Цикл
		Если Не ПустаяСтрока(ЭтаФорма[ЭлементСкриншот.Имя]) Тогда
			УдалитьИзВременногоХранилища(ЭтаФорма[ЭлементСкриншот.Имя]);
			ЭтаФорма[ЭлементСкриншот.Имя] = "";
		КонецЕсли;
	КонецЦикла;
	
	МаксНомерСкриншота = 0;
	
	Если ЗначениеЗаполнено(ОтчетИлиОбработка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДополнительныеОтчетыИОбработкиСкриншоты.Хранилище
			|ИЗ
			|	Справочник.ДополнительныеОтчетыИОбработки.Скриншоты КАК ДополнительныеОтчетыИОбработкиСкриншоты
			|ГДЕ
			|	ДополнительныеОтчетыИОбработкиСкриншоты.Ссылка = &Ссылка";
			
		Запрос.УстановитьПараметр("Ссылка", ОтчетИлиОбработка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ИмяРеквизита = "Скриншот" + МаксНомерСкриншота;
			
			Если Элементы.ГруппаСкриншоты.ПодчиненныеЭлементы.Количество() - 1 < МаксНомерСкриншота Тогда
				НовыеРеквизиты = Новый Массив();
				НовыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Строка")));
				
				ЭтаФорма.ИзменитьРеквизиты(НовыеРеквизиты);
				
				ЭлементСкриншот = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Элементы.ГруппаСкриншоты);
				ЭлементСкриншот.Вид                = ВидПоляФормы.ПолеКартинки;
				ЭлементСкриншот.ПутьКДанным        = ИмяРеквизита;
				ЭлементСкриншот.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				ЭлементСкриншот.РазмерКартинки     = РазмерКартинки.Пропорционально;
				//ЭлементСкриншот.Рамка.ТипРамки     = ТипРамкиЭлементаУправления.БезРамки;
			КонецЕсли;
			
			ЭтаФорма[ИмяРеквизита] = ПоместитьВоВременноеХранилище(Выборка.Хранилище.Получить(), ЭтаФорма.УникальныйИдентификатор);
			
			МаксНомерСкриншота = МаксНомерСкриншота + 1;
		КонецЦикла;
		
	КонецЕсли;
	
	// скроем лишние элементы формы
	Для Инд = 3 По Элементы.ГруппаСкриншоты.ПодчиненныеЭлементы.Количество() - 1 Цикл
		Элементы["Скриншот" + Инд].Видимость = Инд <= МаксНомерСкриншота - 1;
	КонецЦикла;
	
КонецПроцедуры // ОтобразитьСкриншотыНаСервере


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолноправныйПользователь = РольДоступна("ПолныеПрава");

	ЭтаФорма.Элементы.ГруппаСкриншоты.Видимость = ПолноправныйПользователь;
	ЭтаФорма.Элементы.СписокОтветственный.Видимость = ПолноправныйПользователь; 
	
	ЗаполнитьДеревоГруппНаСервере();
	
	// в списке отчетов и обработок группы не отображаются
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "ЭтоГруппа",, ВидСравненияКомпоновкиДанных.Равно, Ложь, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);

КонецПроцедуры


&НаКлиенте
Процедура ДеревоГруппПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоГрупп.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСНастройкамиСписковКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.Список.Отбор, "Родитель",, ВидСравненияКомпоновкиДанных.Равно, ТекущиеДанные.Ссылка, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);

КонецПроцедуры

&НаКлиенте
Процедура ДеревоГруппПередНачаломИзменения(Элемент, Отказ)
	
	ИдТекущейСтроки = Элемент.ТекущиеДанные.ПолучитьИдентификатор();
	
	Если Элемент.Развернут(ИдТекущейСтроки) Тогда
		Элемент.Свернуть(ИдТекущейСтроки);
	Иначе
		Элемент.Развернуть(ИдТекущейСтроки);
	КонецЕсли;
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если ЭтаФорма.Элементы.ГруппаСкриншоты.Видимость Тогда
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			ОтобразитьСкриншотыНаСервере(Неопределено);
		Иначе
			ОтобразитьСкриншотыНаСервере(ТекущиеДанные.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Если Элементы.Список.ТекущийЭлемент = Элементы.Наименование Тогда
		Отказ = Истина;
		КомандаОткрытьОтчетИлиОбработку(Неопределено);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаОбновитьСписок(Команда)
	
	ТекущиеДанные = Элементы.ДеревоГрупп.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		КлючТекущейСтроки = ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	КлючиРазвернутыхСтрокДерева = Новый Массив();
	РаботаСФормамиКлиент.ПолучитьКлючиРазвернутыхСтрокДерева(ЭтаФорма.ДеревоГрупп, Элементы.ДеревоГрупп, "Ссылка", КлючиРазвернутыхСтрокДерева);
	
	ЗаполнитьДеревоГруппНаСервере();
	
	РаботаСФормамиКлиент.ВосстановитьРазвернутыеСтрокиДереваПоКлючу(ЭтаФорма.ДеревоГрупп, Элементы.ДеревоГрупп, "Ссылка", КлючиРазвернутыхСтрокДерева);
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.ДеревоГрупп, Элементы.ДеревоГрупп, "Ссылка", КлючТекущейСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРазвернутьВсеГруппы(Команда)
	
	РаботаСФормамиКлиент.РазвернутьВсеЭлементыДерева(ЭтаФорма.ДеревоГрупп, Элементы.ДеревоГрупп);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСвернутьВсеГруппы(Команда)
	
	РаботаСФормамиКлиент.СвернутьВсеЭлементыДерева(ЭтаФорма.ДеревоГрупп, Элементы.ДеревоГрупп);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьОтчетИлиОбработку(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Предупреждение("Не выбран отчет или обработка");
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Вид = ПредопределенноеЗначение("Перечисление.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет") Тогда
		ПолноеИмяОбъекта = "ВнешнийОтчет." + ТекущиеДанные.ИмяОбъекта;
	Иначе
		ПолноеИмяОбъекта = "ВнешняяОбработка." + ТекущиеДанные.ИмяОбъекта;
	КонецЕсли;
	
	ТекущаяВерсияОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.Ссылка, "Версия");
	
	Для Каждого ТекущееОкно Из ПолучитьОкна() Цикл
		Для Каждого Форма Из ТекущееОкно.Содержимое Цикл
			Если ТипЗнч(Форма) <> Тип("УправляемаяФорма") Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрНачинаетсяС(Форма.ИмяФормы, ПолноеИмяОбъекта) Тогда
				РеквизитыФормы = Новый Структура("ВерсияДополнительногоОтчетаИлиОбработки");
				ЗаполнитьЗначенияСвойств(РеквизитыФормы, Форма);
				
				Если ЗначениеЗаполнено(РеквизитыФормы.ВерсияДополнительногоОтчетаИлиОбработки) Тогда
					Если РеквизитыФормы.ВерсияДополнительногоОтчетаИлиОбработки <> ТекущаяВерсияОбъекта Тогда
						ТекущееОкно.Активизировать();
						ПоказатьПредупреждение(, "Версия отчёта изменилась, для повторного запуска закройте все формы отчёта");
						Возврат;
					КонецЕсли;
				Иначе	
					ТекущееОкно.Активизировать();
					ПоказатьПредупреждение(, "Форма отчёта уже открыта, для повторного запуска закройте форму");
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ИмяПодключенногоОбъекта = РаботаСДополнительнымиОтчетамиИОбработками.ПодключитьВнешнююОбработку(ТекущиеДанные.Ссылка);
	
	Если ТекущиеДанные.Вид = ПредопределенноеЗначение("Перечисление.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет") Тогда
		ОткрытьФорму("ВнешнийОтчет." + ИмяПодключенногоОбъекта + ".Форма");
	Иначе
		ОткрытьФорму("ВнешняяОбработка." + ИмяПодключенногоОбъекта + ".Форма");
	КонецЕсли;
	
КонецПроцедуры
